Revit 2015 API
ValueParsingOptions.FormatOptions Property
 The FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2015.  Use GetFormatOptions() instead.")]
public FormatOptions FormatOptions { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2015.  Use GetFormatOptions() instead.")> _
Public ReadOnly Property FormatOptions As FormatOptions
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2015.  Use GetFormatOptions() instead.")]
public:
property FormatOptions^ FormatOptions {
	FormatOptions^ get ();
}
Remarks
 Reading this property is equivalent to calling GetFormatOptions().
See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace